Revit 2026 API

# CurveElementSketchPlane Property

---

The sketch plane the curve element lies in.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual SketchPlane SketchPlane { get; set; }
```
```vb
Public Overridable Property SketchPlane As SketchPlane
	Get
	Set
```
```cpp
public:
virtual property SketchPlane^ SketchPlane {
	SketchPlane^ get ();
	void set (SketchPlane^ value);
}
```
```fsharp
abstract SketchPlane : SketchPlane with get, set
override SketchPlane : SketchPlane with get, set
```

#### Property Value

SketchPlane

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown if the argument is . |
| InvalidOperationException | Thrown if the CurveElement is CurveByPoints or belongs to a Path3d element. -- or -- Thrown if the sketch plane is set on a DetailCurve. --or-- Thrown if the sketch plane is not parallel to the existing plane. -- or -- Thrown if the sketch plane is not suitable. -- or -- Thrown if the CurveElement belongs to a sketch-based element. -- or -- Thrown if modifying the sketch plane is not allowed. -- or -- Thrown if the CurveElement cannot be moved out of its sketch plane. |

The new sketch plane must be parallel to the existing sketch plane. Setting this property is not permitted for detail curves because they must be placed only on view-specific planes.

#### Reference

CurveElement Class

Autodesk.Revit.DB Namespace